
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ВКМ_ПринятыеУволенныеСотрудники.Записывать = Истина;
	Движения.ВКМ_УсловияОплатыСотрудников.Записывать = Истина;

	
	Для Каждого СтрокаСотрудники Из Сотрудники Цикл
		Специалист = ВКМ_РасчетыИНачисления.ПроверитьДолжностьСотрудника(СтрокаСотрудники.Сотрудник);
	
		СтатусСотрудника = ВКМ_РасчетыИНачисления.ПроверкаСтатусаСотрудника(СтрокаСотрудники.Сотрудник, Дата);
		Если Не СтатусСотрудника Тогда
			Движение = Движения.ВКМ_ПринятыеУволенныеСотрудники.Добавить();
			Движение.Сотрудник = СтрокаСотрудники.Сотрудник;
			Движение.ПринятУволен = Истина;
			Движение.Период = Дата;
			Движение.Регистратор = Ссылка;
			
		КонецЕсли;
				
		Движение = Движения.ВКМ_УсловияОплатыСотрудников.Добавить();
		Движение.Сотрудник = СтрокаСотрудники.Сотрудник;
		Движение.Оклад = СтрокаСотрудники.Оклад;
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Если Специалист Тогда	
		Движение.ПроцентОтРабот = СтрокаСотрудники.ПроцентОтРабот;
		КонецЕсли;
		
	КонецЦикла;

	
КонецПроцедуры

#КонецОбласти



#КонецЕсли

