#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
	
	Для Каждого Сотрудник Из Отпуска Цикл
	    СтатусСотрудника = ВКМ_РасчетыИНачисления.ПроверкаСтатусаСотрудника(Сотрудник.Сотрудник, Год);
	    Если Не СтатусСотрудника Тогда
	    	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1 не является трудоустроенным сотрудником на дату документа", Сотрудник.Сотрудник), 
	    	        ЭтотОбъект, "Отпуска[" + Сотрудник.НомерСтроки + "].Сотрудник", "Объект", Отказ);
	    	Продолжить
	    КонецЕсли;
	    
	    КонецОтпуска = Сотрудник.ДатаОкончания;
	    	    
	    Если  Сотрудник.ДнейОтпуска > 28 Тогда
	    	НеоплачиваемыхДней = (Сотрудник.ДнейОтпуска - 28) * 86400;
	    	КонецОтпуска = Сотрудник.ДатаОкончания - НеоплачиваемыхДней; 	
	    
            Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
            Движение.Период = Год;
            Движение.Оплачиваемый = Ложь;
            Движение.Сотрудник = Сотрудник.Сотрудник;
            Движение.ДатаНачала = Сотрудник.ДатаОкончания - НеоплачиваемыхДней + 86400;
            Движение.ДатаОкончания = Сотрудник.ДатаОкончания;
    
	    КонецЕсли;
	    Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
	    Движение.Период = Год;
	    Движение.Оплачиваемый = Истина;
	    Движение.Сотрудник = Сотрудник.Сотрудник;
	    Движение.ДатаНачала = Сотрудник.ДатаНачала;
	    Движение.ДатаОкончания =  КонецОтпуска;
	    	
		
	КонецЦикла;


КонецПроцедуры
#КонецОбласти

#КонецЕсли