#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ДанныеОВыплатах = ВКМ_РасчетыИНачисления.ПолучитьДанныеОВыплатахЗарплаты(КонецДня(Объект.Дата));
	Если ДанныеОВыплатах.Количество() > 0 Тогда
		Если Объект.Выплаты.Количество()> 0 Тогда
			Объект.Выплаты.Очистить();
		КонецЕсли;
		
		Объект.Выплаты.Загрузить(ДанныеОВыплатах);
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Нет данных о выплатах сотрудникам");
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
