#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонетскоеОбслуживание Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВКМ_ДатаНачалаДействияДоговора");
		МассивНепроверяемыхРеквизитов.Добавить("ВКМ_ДатаОкончанияДействияДоговора");
		МассивНепроверяемыхРеквизитов.Добавить("ВКМ_СтоимостьЧасаРаботы");
		МассивНепроверяемыхРеквизитов.Добавить("ВКМ_СуммаАбонентскойПлаты");
	КонецЕсли;
		
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонетскоеОбслуживание Тогда
		ВКМ_ДатаНачалаДействияДоговора = Неопределено;
		ВКМ_ДатаОкончанияДействияДоговора = Неопределено;
		ВКМ_СтоимостьЧасаРаботы = Неопределено;
		ВКМ_СуммаАбонентскойПлаты = Неопределено; 	
	Иначе
		 Если ВКМ_ДатаОкончанияДействияДоговора <= ВКМ_ДатаНачалаДействияДоговора Тогда
		 ОбщегоНазначения.СообщитьПользователю("Дата окончания договора не должна быть раньше даты его начала!");
		 Отказ = Истина;;
		 КонецЕсли;	 
	КонецЕсли;
	
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
