#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВКМ_ВидимостьЭлементов()
		
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ВКМ_ВидимостьЭлементов()
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
//Регулирует видимость элементов
Процедура ВКМ_ВидимостьЭлементов()
	
	Если Объект.Сотрудник = Истина Тогда
		ЭлементыСкрыть = Истина;
	Иначе
		ЭлементыСкрыть = Ложь;;
	КонецЕсли;
	
	    Элементы.Должность.Видимость = ЭлементыСкрыть;
		
КонецПроцедуры


#КонецОбласти
