#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыФормы = Параметры;
	Адрес = ПараметрыФормы.Адрес;
	ТаблицаЗначений = ПолучитьИзВременногоХранилища(Адрес);
	
	ДГ.Обновление = Ложь;
    ДГ.Очистить();
    
	ДГ.АвтоОпределениеПолногоИнтервала = Ложь;
	ДГ.УстановитьПолныйИнтервал(НачалоГода(ПараметрыФормы.Период),КонецГода(ПараметрыФормы.Период) );

	Серия = ДГ.УстановитьСерию("Отпуска");
		
	Для Каждого СтрокаТЗ ИЗ ТаблицаЗначений Цикл
    	Точка = ДГ.УстановитьТочку(СтрокаТЗ.Сотрудник);
    	Точка.Текст = СтрокаТЗ.Сотрудник;
    	
    	Значение = ДГ.ПолучитьЗначение(Точка, Серия);

        Интервал = Значение.Добавить();

        Интервал.Начало = СтрокаТЗ.ДатаНачала;

        Интервал.Конец = СтрокаТЗ.ДатаОкончания;

КонецЦикла;

ДГ.Обновление = Истина;

КонецПроцедуры

#КонецОбласти

	

