
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпуска
&НаКлиенте
Процедура ОтпускаДатаНачалаПриИзменении(Элемент)
	ТекДанные = Элементы.Отпуска.ТекущиеДанные;
	РасчитатьДнейОтпуска(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаДатаОкончанияПриИзменении(Элемент)
	ТекДанные = Элементы.Отпуска.ТекущиеДанные;
	РасчитатьДнейОтпуска(ТекДанные);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ГрафикОтпусков(Команда)
	
	Адрес = СформироватьТаблицуЗначений();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес", Адрес);
	ПараметрыФормы.Вставить("Период",Объект.Год);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика",ПараметрыФормы ,ЭтотОбъект ,
	УникальныйИдентификатор ,Окно, , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
    
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчитатьДнейОтпуска(ТекДанные)
	ТекДанные.ДнейОтпуска = (ТекДанные.ДатаОкончания - ТекДанные.ДатаНачала)/86400;
КонецПроцедуры

&НаСервере
Функция СформироватьТаблицуЗначений()

ТаблицаЗначений = Объект.Отпуска.Выгрузить();
Адрес = ПоместитьВоВременноеХранилище(ТаблицаЗначений, УникальныйИдентификатор);
Возврат Адрес

КонецФункции


#КонецОбласти

