#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВКМ_ВидимостьЭлементов()
		
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	 
    ВКМ_ВидимостьЭлементов()

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
//Регулирует видимость элементов
Процедура ВКМ_ВидимостьЭлементов()
	
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонетскоеОбслуживание Тогда
		ЭлементыСкрыть = Ложь;
	Иначе
		ЭлементыСкрыть = Истина;
	КонецЕсли;
	
	    Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = ЭлементыСкрыть;
		Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = ЭлементыСкрыть;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = ЭлементыСкрыть;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = ЭлементыСкрыть;
		
КонецПроцедуры


#КонецОбласти
