#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.НачислениеВыплат.Количество()>0 Тогда
		Объект.НачислениеВыплат.Очистить();
	КонецЕсли;
	
	ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьНаСервере()
	ДанныеДляЗаполнения = ВКМ_РасчетыИНачисления.ПолучитьДанныеОНачислениях(Объект.Дата);
	Если ДанныеДляЗаполнения.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Нет данных для начисления, проверьте заполнение работающих сотрудников и условия их оплат!");
		Возврат
	КонецЕсли;
	
	Для Каждого Строка Из ДанныеДляЗаполнения Цикл
	Если Не Строка.РаботаетНаНачалоПериода и Не Строка.РаботаетНаКонецПериода Тогда
		Продолжить;
	КонецЕсли;
	
		Если Строка.Оклад > 0 Тогда
			СтрокаТЧ = Объект.НачислениеВыплат.Добавить();
		    СтрокаТЧ.Сотрудник = Строка.Сотрудник;
			СтрокаТЧ.ВидВыплаты = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад;
			СтрокаТЧ.Начислено = Строка.Оклад;
			СтрокаТЧ.ДатаНачала = НачалоМесяца(Объект.Дата);
			СтрокаТч.ДатаОкончания = КонецМесяца(Объект.Дата);
			Если Не Строка.РаботаетНаНачалоПериода Тогда
			СтрокаТЧ.ДатаНачала = Строка.ДатаПриемаУвольнения;
			КонецЕсли;
			Если Не Строка.РаботаетНаКонецПериода Тогда
			СтрокаТч.ДатаОкончания = Строка.ДатаПриемаУвольнения;	
			КонецЕсли;			
		КонецЕсли;
		
		Если Строка.ПроцентОтРабот > 0 Тогда
			СтрокаТЧ = Объект.НачислениеВыплат.Добавить();
		    СтрокаТЧ.Сотрудник = Строка.Сотрудник;
			СтрокаТЧ.ВидВыплаты = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ОплатаЗаВыполненныеРаботы;
			СтрокаТЧ.Начислено = Строка.ПроцентОтРабот;
			СтрокаТЧ.ДатаНачала = НачалоМесяца(Объект.Дата);
			СтрокаТч.ДатаОкончания = КонецМесяца(Объект.Дата);
		КонецЕсли;
		
		Если Строка.Отпуск Тогда
			СреднедневнойОкладЗаГод = ВКМ_РасчетыИНачисления.ПолучитьНачисленияПоСотрудникуЗаГод(Строка.Сотрудник, Объект.Дата);
					
			СтрокаТч = Объект.НачислениеВыплат.Добавить();
			СтрокаТЧ.Сотрудник =  Строка.Сотрудник;
			СтрокаТЧ.ВидВыплаты = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпускные;
			СтрокаТЧ.Начислено = СреднедневнойОкладЗаГод;
			СтрокаТЧ.ДатаНачала = Строка.НачалоОтпуска;
			СтрокаТч.ДатаОкончания = Строка.КонецОтпуска;
		КонецЕсли;
		
		Если Строка.ЕстьНеоплачиваемыйОтпуск Тогда
			СтрокаТч = Объект.НачислениеВыплат.Добавить();
			СтрокаТЧ.Сотрудник =  Строка.Сотрудник;
			СтрокаТЧ.ВидВыплаты = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпускные;
			СтрокаТЧ.Начислено = 0;
			СтрокаТЧ.ДатаНачала = Строка.ЗаСвойСчетНачало;
			СтрокаТч.ДатаОкончания = Строка.ЗаСвойСчетОкончание;
		КонецЕсли;
			
		
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
